<?php
defined('PASSPORT') or exit('没有访问权限!');

/*
----------------------------------------------------------------
                        开启session
----------------------------------------------------------------
*/
session_start();

/*
----------------------------------------------------------------
                        定义核心目录
----------------------------------------------------------------
*/
define("CORE", SRCPATH.'/core');//定义核心目录


/*
----------------------------------------------------------------
                        定义常量
----------------------------------------------------------------
*/
//定义cookie的保存路径
define("COOKIEPATH", '/mongofly/');

/*
----------------------------------------------------------------
                        加载函数库
----------------------------------------------------------------
*/

require_once CORE . '/init/functions.php';
/*
----------------------------------------------------------------
                        定义静态域名常量
----------------------------------------------------------------
*/

$static = (static_domain())?static_domain():'http://' . $_SERVER['HTTP_HOST'];

define("RESOURCE", $static);

/*
----------------------------------------------------------------
                        定义网站域名常量
----------------------------------------------------------------
*/
//定义网站域名
$domain = (domain_url())?domain_url():'http://' . $_SERVER['HTTP_HOST'];

define('DOMAIN',$domain);

/*
----------------------------------------------------------------
                        引入加载类
----------------------------------------------------------------
*/
require_once CORE . '/system/load.php';
/*
----------------------------------------------------------------
                        加载核心类
----------------------------------------------------------------
*/
require_once CORE . '/system/sc.php';
/*
----------------------------------------------------------------
                        加载核心模型类
----------------------------------------------------------------
*/
require_once CORE . '/system/model.php';
/*
----------------------------------------------------------------
                        根据地址栏参数，加载相应的控制器和方法
----------------------------------------------------------------
*/
ob_clean();
//c参数表示controller，默认加载登陆类
$controller = isset($_GET['c']) ? $_GET['c'] : 'sign';
//a参数表示action，默认加载登陆方法
$action = isset($_GET['a']) ? $_GET['a'] : 'login';
//将控制器文件名转化成小写
$controller = strtolower($controller);
//类文件路径
$classpath = APP . '/controller/' . $controller . '.php';

if (!file_exists($classpath)) {
    __error($controller.'控制器文件不存在');
}
//加载类文件
require_once($classpath);
//类名
$class_name = ucfirst($controller);
//检查控制器是否存在
if (!class_exists($class_name)) {
    __error($class_name.'类不存在');
}
//实例化控制器类
$controller_obj = new $class_name();
//检查控制器内的方法是否存在
if (!method_exists($controller_obj, $action)) {
    __error($class_name.'类中不存在' . $action . '方法');
}
//调用方法
$controller_obj->$action();
?>